#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Sat Nov  5 21:16:32 2022
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 20 -waveform {0 10} -name vsysclk 
group_path -name I2R -from [list [get_ports {B[0]}] [get_ports {B[1]}] [get_ports {B[2]}] [get_ports {B[3]}] [get_ports {B[4]}] [get_ports {B[5]}] [get_ports {B[6]}] [get_ports {B[7]}] [get_ports {B[8]}] [get_ports {B[9]}] [get_ports {B[10]}] [get_ports {B[11]}] [get_ports {B[12]}] [get_ports {B[13]}] [get_ports {B[14]}] [get_ports {B[15]}] [get_ports {B[16]}] [get_ports {B[17]}] [get_ports {B[18]}] [get_ports {B[19]}] [get_ports {B[20]}] [get_ports {B[21]}] [get_ports {B[22]}] [get_ports {B[23]}] [get_ports {B[24]}] [get_ports {B[25]}] [get_ports {B[26]}] [get_ports {B[27]}] [get_ports {B[28]}] [get_ports {B[29]}] [get_ports {B[30]}] [get_ports {B[31]}] [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}] [get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}] [get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}] [get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports {A[14]}] [get_ports {A[15]}] [get_ports {A[16]}] [get_ports {A[17]}] [get_ports {A[18]}] [get_ports {A[19]}] [get_ports {A[20]}] [get_ports {A[21]}] [get_ports {A[22]}] [get_ports {A[23]}] [get_ports {A[24]}] [get_ports {A[25]}] [get_ports {A[26]}] [get_ports {A[27]}] [get_ports {A[28]}] [get_ports {A[29]}] [get_ports {A[30]}] [get_ports {A[31]}]]
group_path -name I2O -from [list [get_ports {B[0]}] [get_ports {B[1]}] [get_ports {B[2]}] [get_ports {B[3]}] [get_ports {B[4]}] [get_ports {B[5]}] [get_ports {B[6]}] [get_ports {B[7]}] [get_ports {B[8]}] [get_ports {B[9]}] [get_ports {B[10]}] [get_ports {B[11]}] [get_ports {B[12]}] [get_ports {B[13]}] [get_ports {B[14]}] [get_ports {B[15]}] [get_ports {B[16]}] [get_ports {B[17]}] [get_ports {B[18]}] [get_ports {B[19]}] [get_ports {B[20]}] [get_ports {B[21]}] [get_ports {B[22]}] [get_ports {B[23]}] [get_ports {B[24]}] [get_ports {B[25]}] [get_ports {B[26]}] [get_ports {B[27]}] [get_ports {B[28]}] [get_ports {B[29]}] [get_ports {B[30]}] [get_ports {B[31]}] [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}] [get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}] [get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}] [get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports {A[14]}] [get_ports {A[15]}] [get_ports {A[16]}] [get_ports {A[17]}] [get_ports {A[18]}] [get_ports {A[19]}] [get_ports {A[20]}] [get_ports {A[21]}] [get_ports {A[22]}] [get_ports {A[23]}] [get_ports {A[24]}] [get_ports {A[25]}] [get_ports {A[26]}] [get_ports {A[27]}] [get_ports {A[28]}] [get_ports {A[29]}] [get_ports {A[30]}] [get_ports {A[31]}]]  -to [list [get_ports OF] [get_ports {O[0]}] [get_ports {O[1]}] [get_ports {O[2]}] [get_ports {O[3]}] [get_ports {O[4]}] [get_ports {O[5]}] [get_ports {O[6]}] [get_ports {O[7]}] [get_ports {O[8]}] [get_ports {O[9]}] [get_ports {O[10]}] [get_ports {O[11]}] [get_ports {O[12]}] [get_ports {O[13]}] [get_ports {O[14]}] [get_ports {O[15]}] [get_ports {O[16]}] [get_ports {O[17]}] [get_ports {O[18]}] [get_ports {O[19]}] [get_ports {O[20]}] [get_ports {O[21]}] [get_ports {O[22]}] [get_ports {O[23]}] [get_ports {O[24]}] [get_ports {O[25]}] [get_ports {O[26]}] [get_ports {O[27]}] [get_ports {O[28]}] [get_ports {O[29]}] [get_ports {O[30]}] [get_ports {O[31]}]]
group_path -name R2O -to [list [get_ports OF] [get_ports {O[0]}] [get_ports {O[1]}] [get_ports {O[2]}] [get_ports {O[3]}] [get_ports {O[4]}] [get_ports {O[5]}] [get_ports {O[6]}] [get_ports {O[7]}] [get_ports {O[8]}] [get_ports {O[9]}] [get_ports {O[10]}] [get_ports {O[11]}] [get_ports {O[12]}] [get_ports {O[13]}] [get_ports {O[14]}] [get_ports {O[15]}] [get_ports {O[16]}] [get_ports {O[17]}] [get_ports {O[18]}] [get_ports {O[19]}] [get_ports {O[20]}] [get_ports {O[21]}] [get_ports {O[22]}] [get_ports {O[23]}] [get_ports {O[24]}] [get_ports {O[25]}] [get_ports {O[26]}] [get_ports {O[27]}] [get_ports {O[28]}] [get_ports {O[29]}] [get_ports {O[30]}] [get_ports {O[31]}]]
set_load 10 [get_ports {O[31]}]
set_load 10 [get_ports {O[30]}]
set_load 10 [get_ports {O[29]}]
set_load 10 [get_ports {O[28]}]
set_load 10 [get_ports {O[27]}]
set_load 10 [get_ports {O[26]}]
set_load 10 [get_ports {O[25]}]
set_load 10 [get_ports {O[24]}]
set_load 10 [get_ports {O[23]}]
set_load 10 [get_ports {O[22]}]
set_load 10 [get_ports {O[21]}]
set_load 10 [get_ports {O[20]}]
set_load 10 [get_ports {O[19]}]
set_load 10 [get_ports {O[18]}]
set_load 10 [get_ports {O[17]}]
set_load 10 [get_ports {O[16]}]
set_load 10 [get_ports {O[15]}]
set_load 10 [get_ports {O[14]}]
set_load 10 [get_ports {O[13]}]
set_load 10 [get_ports {O[12]}]
set_load 10 [get_ports {O[11]}]
set_load 10 [get_ports {O[10]}]
set_load 10 [get_ports {O[9]}]
set_load 10 [get_ports {O[8]}]
set_load 10 [get_ports {O[7]}]
set_load 10 [get_ports {O[6]}]
set_load 10 [get_ports {O[5]}]
set_load 10 [get_ports {O[4]}]
set_load 10 [get_ports {O[3]}]
set_load 10 [get_ports {O[2]}]
set_load 10 [get_ports {O[1]}]
set_load 10 [get_ports {O[0]}]
set_load 10 [get_ports OF]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[31]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[30]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[29]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[28]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[27]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[26]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[25]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[24]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[23]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[22]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[21]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[20]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[19]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[18]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[17]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[16]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[15]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[14]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[13]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[12]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[11]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[10]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[9]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[8]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[7]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[6]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[5]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[4]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[3]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[2]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[1]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {A[0]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[31]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[30]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[29]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[28]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[27]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[26]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[25]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[24]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[23]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[22]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[21]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[20]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[19]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[18]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[17]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[16]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[15]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[14]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[13]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[12]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[11]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[10]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[9]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[8]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[7]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[6]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[5]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[4]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[3]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[2]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[1]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {B[0]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[31]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[30]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[29]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[28]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[27]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[26]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[25]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[24]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[23]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[22]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[21]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[20]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[19]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[18]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[17]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[16]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[15]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[14]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[13]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[12]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[11]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[10]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[9]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[8]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[7]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[6]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[5]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[4]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[3]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[2]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[1]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {O[0]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports OF]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
