#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Sat Nov  5 14:59:49 2022
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 20 -waveform {0 10} -name vsysclk 
group_path -name I2R -from [list [get_ports Cin] [get_ports {b[0]}] [get_ports {b[1]}] [get_ports {b[2]}] [get_ports {b[3]}] [get_ports {b[4]}] [get_ports {b[5]}] [get_ports {b[6]}] [get_ports {b[7]}] [get_ports {b[8]}] [get_ports {b[9]}] [get_ports {b[10]}] [get_ports {b[11]}] [get_ports {b[12]}] [get_ports {b[13]}] [get_ports {b[14]}] [get_ports {b[15]}] [get_ports {b[16]}] [get_ports {b[17]}] [get_ports {b[18]}] [get_ports {b[19]}] [get_ports {b[20]}] [get_ports {b[21]}] [get_ports {b[22]}] [get_ports {b[23]}] [get_ports {b[24]}] [get_ports {b[25]}] [get_ports {b[26]}] [get_ports {b[27]}] [get_ports {b[28]}] [get_ports {b[29]}] [get_ports {b[30]}] [get_ports {b[31]}] [get_ports {a[0]}] [get_ports {a[1]}] [get_ports {a[2]}] [get_ports {a[3]}] [get_ports {a[4]}] [get_ports {a[5]}] [get_ports {a[6]}] [get_ports {a[7]}] [get_ports {a[8]}] [get_ports {a[9]}] [get_ports {a[10]}] [get_ports {a[11]}] [get_ports {a[12]}] [get_ports {a[13]}] [get_ports {a[14]}] [get_ports {a[15]}] [get_ports {a[16]}] [get_ports {a[17]}] [get_ports {a[18]}] [get_ports {a[19]}] [get_ports {a[20]}] [get_ports {a[21]}] [get_ports {a[22]}] [get_ports {a[23]}] [get_ports {a[24]}] [get_ports {a[25]}] [get_ports {a[26]}] [get_ports {a[27]}] [get_ports {a[28]}] [get_ports {a[29]}] [get_ports {a[30]}] [get_ports {a[31]}]]
group_path -name I2O -from [list [get_ports Cin] [get_ports {b[0]}] [get_ports {b[1]}] [get_ports {b[2]}] [get_ports {b[3]}] [get_ports {b[4]}] [get_ports {b[5]}] [get_ports {b[6]}] [get_ports {b[7]}] [get_ports {b[8]}] [get_ports {b[9]}] [get_ports {b[10]}] [get_ports {b[11]}] [get_ports {b[12]}] [get_ports {b[13]}] [get_ports {b[14]}] [get_ports {b[15]}] [get_ports {b[16]}] [get_ports {b[17]}] [get_ports {b[18]}] [get_ports {b[19]}] [get_ports {b[20]}] [get_ports {b[21]}] [get_ports {b[22]}] [get_ports {b[23]}] [get_ports {b[24]}] [get_ports {b[25]}] [get_ports {b[26]}] [get_ports {b[27]}] [get_ports {b[28]}] [get_ports {b[29]}] [get_ports {b[30]}] [get_ports {b[31]}] [get_ports {a[0]}] [get_ports {a[1]}] [get_ports {a[2]}] [get_ports {a[3]}] [get_ports {a[4]}] [get_ports {a[5]}] [get_ports {a[6]}] [get_ports {a[7]}] [get_ports {a[8]}] [get_ports {a[9]}] [get_ports {a[10]}] [get_ports {a[11]}] [get_ports {a[12]}] [get_ports {a[13]}] [get_ports {a[14]}] [get_ports {a[15]}] [get_ports {a[16]}] [get_ports {a[17]}] [get_ports {a[18]}] [get_ports {a[19]}] [get_ports {a[20]}] [get_ports {a[21]}] [get_ports {a[22]}] [get_ports {a[23]}] [get_ports {a[24]}] [get_ports {a[25]}] [get_ports {a[26]}] [get_ports {a[27]}] [get_ports {a[28]}] [get_ports {a[29]}] [get_ports {a[30]}] [get_ports {a[31]}]]  -to [list [get_ports of] [get_ports Cout] [get_ports {sum[0]}] [get_ports {sum[1]}] [get_ports {sum[2]}] [get_ports {sum[3]}] [get_ports {sum[4]}] [get_ports {sum[5]}] [get_ports {sum[6]}] [get_ports {sum[7]}] [get_ports {sum[8]}] [get_ports {sum[9]}] [get_ports {sum[10]}] [get_ports {sum[11]}] [get_ports {sum[12]}] [get_ports {sum[13]}] [get_ports {sum[14]}] [get_ports {sum[15]}] [get_ports {sum[16]}] [get_ports {sum[17]}] [get_ports {sum[18]}] [get_ports {sum[19]}] [get_ports {sum[20]}] [get_ports {sum[21]}] [get_ports {sum[22]}] [get_ports {sum[23]}] [get_ports {sum[24]}] [get_ports {sum[25]}] [get_ports {sum[26]}] [get_ports {sum[27]}] [get_ports {sum[28]}] [get_ports {sum[29]}] [get_ports {sum[30]}] [get_ports {sum[31]}]]
group_path -name R2O -to [list [get_ports of] [get_ports Cout] [get_ports {sum[0]}] [get_ports {sum[1]}] [get_ports {sum[2]}] [get_ports {sum[3]}] [get_ports {sum[4]}] [get_ports {sum[5]}] [get_ports {sum[6]}] [get_ports {sum[7]}] [get_ports {sum[8]}] [get_ports {sum[9]}] [get_ports {sum[10]}] [get_ports {sum[11]}] [get_ports {sum[12]}] [get_ports {sum[13]}] [get_ports {sum[14]}] [get_ports {sum[15]}] [get_ports {sum[16]}] [get_ports {sum[17]}] [get_ports {sum[18]}] [get_ports {sum[19]}] [get_ports {sum[20]}] [get_ports {sum[21]}] [get_ports {sum[22]}] [get_ports {sum[23]}] [get_ports {sum[24]}] [get_ports {sum[25]}] [get_ports {sum[26]}] [get_ports {sum[27]}] [get_ports {sum[28]}] [get_ports {sum[29]}] [get_ports {sum[30]}] [get_ports {sum[31]}]]
set_load 10 [get_ports {sum[31]}]
set_load 10 [get_ports {sum[30]}]
set_load 10 [get_ports {sum[29]}]
set_load 10 [get_ports {sum[28]}]
set_load 10 [get_ports {sum[27]}]
set_load 10 [get_ports {sum[26]}]
set_load 10 [get_ports {sum[25]}]
set_load 10 [get_ports {sum[24]}]
set_load 10 [get_ports {sum[23]}]
set_load 10 [get_ports {sum[22]}]
set_load 10 [get_ports {sum[21]}]
set_load 10 [get_ports {sum[20]}]
set_load 10 [get_ports {sum[19]}]
set_load 10 [get_ports {sum[18]}]
set_load 10 [get_ports {sum[17]}]
set_load 10 [get_ports {sum[16]}]
set_load 10 [get_ports {sum[15]}]
set_load 10 [get_ports {sum[14]}]
set_load 10 [get_ports {sum[13]}]
set_load 10 [get_ports {sum[12]}]
set_load 10 [get_ports {sum[11]}]
set_load 10 [get_ports {sum[10]}]
set_load 10 [get_ports {sum[9]}]
set_load 10 [get_ports {sum[8]}]
set_load 10 [get_ports {sum[7]}]
set_load 10 [get_ports {sum[6]}]
set_load 10 [get_ports {sum[5]}]
set_load 10 [get_ports {sum[4]}]
set_load 10 [get_ports {sum[3]}]
set_load 10 [get_ports {sum[2]}]
set_load 10 [get_ports {sum[1]}]
set_load 10 [get_ports {sum[0]}]
set_load 10 [get_ports Cout]
set_load 10 [get_ports of]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[31]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[30]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[29]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[28]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[27]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[26]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[25]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[24]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[23]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[22]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[21]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[20]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[19]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[18]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[17]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[16]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[15]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[14]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[13]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[12]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[11]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[10]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[9]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[8]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[7]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[6]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[5]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[4]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[3]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[2]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[1]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {a[0]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[31]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[30]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[29]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[28]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[27]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[26]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[25]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[24]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[23]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[22]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[21]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[20]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[19]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[18]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[17]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[16]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[15]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[14]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[13]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[12]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[11]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[10]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[9]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[8]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[7]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[6]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[5]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[4]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[3]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[2]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[1]}]
set_input_delay 1 -clock vsysclk -rise [get_ports {b[0]}]
set_input_delay 1 -clock vsysclk -rise [get_ports Cin]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[31]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[30]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[29]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[28]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[27]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[26]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[25]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[24]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[23]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[22]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[21]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[20]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[19]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[18]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[17]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[16]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[15]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[14]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[13]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[12]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[11]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[10]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[9]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[8]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[7]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[6]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[5]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[4]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[3]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[2]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[1]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports {sum[0]}]
set_output_delay 0.5 -clock vsysclk -fall [get_ports Cout]
set_output_delay 0.5 -clock vsysclk -fall [get_ports of]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
